In [5]:
import numpy as np 
import pandas as pd 

v1=np.array([1,3,6,np.nan,7,1,np.nan,9,15])
v2=np.array([7,np.nan,5,8,12,np.nan,np.nan,2,3])

v3=np.array([np.nan,10,11,8,np.nan,9,14,30,45])
v4=np.array(["IT","IT","IT","IT","IT","IK","IK","IK","IK"])            
df=pd.DataFrame({"maas":v1,"v2":v2,"v3":v3,"departman":v4})
df

   maas    v2    v3 departman
0   1.0   7.0   NaN        IT
1   3.0   NaN  10.0        IT
2   6.0   5.0  11.0        IT
3   NaN   8.0   8.0        IT
4   7.0  12.0   NaN        IT
5   1.0   NaN   9.0        IK
6   NaN   NaN  14.0        IK
7   9.0   2.0  30.0        IK
8  15.0   3.0  45.0        IK

In [6]:
# değişkenler kırılımında doldurma işlemleri ele alınıyor

In [7]:
df

   maas    v2    v3 departman
0   1.0   7.0   NaN        IT
1   3.0   NaN  10.0        IT
2   6.0   5.0  11.0        IT
3   NaN   8.0   8.0        IT
4   7.0  12.0   NaN        IT
5   1.0   NaN   9.0        IK
6   NaN   NaN  14.0        IK
7   9.0   2.0  30.0        IK
8  15.0   3.0  45.0        IK

In [8]:
df.groupby("departman")["maas"].mean()

departman
IK    8.333333
IT    4.250000
Name: maas, dtype: float64

In [10]:
df["maas"].fillna(df.groupby("departman")["maas"].transform("mean"))

0     1.000000
1     3.000000
2     6.000000
3     4.250000
4     7.000000
5     1.000000
6     8.333333
7     9.000000
8    15.000000
Name: maas, dtype: float64